---
kind: type
id: T:Autodesk.Revit.DB.ScheduleFieldDisplayType
source: html/e7f18e54-26a9-88f7-15ef-4c3a1f7bf066.htm
---
# Autodesk.Revit.DB.ScheduleFieldDisplayType

Display type of schedule field.

## Syntax (C#)
```csharp
public enum ScheduleFieldDisplayType
```